In [3]:
import pandas as pd

In [4]:
df_movie_rating = pd.DataFrame(
    {'movie1': [5, 4, 3, 3, 2, 1],
     'movie2': [4, 5, 2, 3, 4, 2]},
    index=["Tom", "Jeff", "Peter", "Ram", "Ted", "Paul"]
)

In [5]:
# define a function to rate the movies
def movie_rating(rating):
    if rating == 5:
        return 'A'
    elif rating == 4:
        return 'B'
    elif rating == 3:
        return 'C'
    else: 
        return 'F'
    
print(movie_rating(4))

B

In [6]:
df_movie_rating

       movie1  movie2
Tom         5       4
Jeff        4       5
Peter       3       2
Ram         3       3
Ted         2       4
Paul        1       2

In [7]:
# applymap() applies a funciton to a DataFrame elementwise
df_movie_rating.applymap(movie_rating)

      movie1 movie2
Tom        A      B
Jeff       B      A
Peter      C      F
Ram        C      C
Ted        F      B
Paul       F      F

In [8]:
# statistical functions
print(df_movie_rating.max())
print(df_movie_rating.min())
print(df_movie_rating.mean())
print(df_movie_rating.std())

movie1    5
movie2    5
dtype: int64
movie1    1
movie2    2
dtype: int64
movie1    3.000000
movie2    3.333333
dtype: float64
movie1    1.414214
movie2    1.211060
dtype: float64

In [9]:
df_president_name = pd.DataFrame({"first": ["George", "Bill", "Ronald", "Jimmy", "George"],
                                  "Last": ["Bush", "Clinton", "Regan", "Carter", "Washington"]})

In [10]:
grouped = df_president_name.groupby("first")

In [11]:
grp_data = grouped.get_group("George")
grp_data

    first        Last
0  George        Bush
4  George  Washington

In [12]:
# standardization is a big thing

In [14]:
df_student_math = pd.DataFrame(
    {
        "student": ["Tom", "Jack", "Dan", "Ram", "Jeff", "David"],
        "ID": [10, 56, 31, 85, 9, 22]
    })
df_student_math

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22

In [21]:
# define the student dataFrame with science data
df_student_science = pd.DataFrame(
    {"student": ["Tom", "Ram", "David"], "ID": [10, 12, 22]})

In [22]:
# let us try to merge both datasets
# by default, the merge function works only when id's AND the names match
# so merge is sort of an AND operation
pd.merge(df_student_math, df_student_science)

  student  ID
0     Tom  10
1   David  22

In [23]:
# you can change the merge crieria by passing a key using the on argument
pd.merge(df_student_science, df_student_math, on="student")

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    12    85
2   David    22    22

In [26]:
# merge left join on key ID and fill NaN values with X
pd.merge(df_student_math, df_student_science, on="ID", how="left").fillna("X")

  student_x  ID student_y
0       Tom  10       Tom
1         X  12       Ram
2     David  22     David

In [29]:
# concatenate dataframes
pd.concat([df_student_science, df_student_math], ignore_index=True)

# ignore the index and have a unified index hehe

  student  ID
0     Tom  10
1     Ram  12
2   David  22
3     Tom  10
4    Jack  56
5     Dan  31
6     Ram  85
7    Jeff   9
8   David  22

In [35]:
df_president_name[0:4]

    first     Last
0  George     Bush
1    Bill  Clinton
2  Ronald    Regan
3   Jimmy   Carter